In [2]:
import pandas as pd

### SERIES

- Creating Pandas-Series(column)
  - It is a 1D column which holds data of different types

In [18]:
new_series = [1,5,99,'usama', True, 11.56]
print(pd.Series(new_series))

0        1
1        5
2       99
3    usama
4     True
5    11.56
dtype: object

- Getting data row-wise using indexing.

In [4]:
second_series = [1,22,63,79,28,70,99]
second_series = pd.Series(second_series)
print(second_series[3])

79

- Creating our own indexing for the Series.

In [5]:
third_series = [32,65,4,96,42,88,17,9801,6432]
third_series = pd.Series(third_series, index=['A', 'B','C','D','E','F','G','H','I'])
print(third_series)

A      32
B      65
C       4
D      96
E      42
F      88
G      17
H    9801
I    6432
dtype: int64

- Making series in Dictionary

In [6]:
dict_series = {'Day1': 230, 'Day2': 120, 'Day3': 450}
dict_series = pd.Series(dict_series)
print(dict_series)

Day1    230
Day2    120
Day3    450
dtype: int64

- Getting Data from Dictionary using Indexing.

In [7]:
dict_series = {'Day1': 230, 'Day2': 120, 'Day3': 450}
dict_series = pd.Series(dict_series)
print(dict_series['Day2'])

120

---

### DATAFRAMES

- Data sets in python are usually multidimensional tables, and they are called DataFrames.
  - Series are only columns and DataFrames are whole tables.

Below we will create DataFrames using 2 or Series. And also override the default indexing

In [2]:
data_frame = {'cal': [458,550,230,100,230], "duration": [20,40,80,96,36]}
data_frame = pd.DataFrame(data_frame, index=['a','b', 'c','d','e'])
print(data_frame)

   cal  duration
a  458        20
b  550        40
c  230        80
d  100        96
e  230        36

- TO check columns and Rows in a Dataset

In [8]:
print("Index_Names", data_frame.index)
print("Column_Names",data_frame.columns)

Index_Names Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
Column_Names Index(['cal', 'duration'], dtype='object')

- To get Details related to dataset either of null-values, no. of rows, data types and memory usage.

In [10]:
data_frame.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   cal       5 non-null      int64
 1   duration  5 non-null      int64
dtypes: int64(2)
memory usage: 120.0+ bytes

- TO get Mean, Median, and other statistical information of the Dataset.

In [11]:
data_frame.describe()

              cal   duration
count    5.000000   5.000000
mean   313.600000  54.400000
std    184.620692  32.074912
min    100.000000  20.000000
25%    230.000000  36.000000
50%    230.000000  40.000000
75%    458.000000  80.000000
max    550.000000  96.000000

### Import Dataset

In [3]:
cofee_data = pd.read_csv('coffee.csv')

In [4]:
cofee_data

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

A). How To Access Individual or More than One Column in a dataset.

In [40]:
# Below code gives list of all columns in a dataset.
cofee_data.columns

Index(['Day', 'Coffee Type', 'Units Sold'], dtype='object')

A-1) Accessing Individual/Multiple Columns.

In [44]:
cofee_data['Coffee Type'] # Return only One Column
cofee_data[['Coffee Type', 'Day']] # Return Both columns

   Coffee Type        Day
0     Espresso     Monday
1        Latte     Monday
2     Espresso    Tuesday
3        Latte    Tuesday
4     Espresso  Wednesday
5        Latte  Wednesday
6     Espresso   Thursday
7        Latte   Thursday
8     Espresso     Friday
9        Latte     Friday
10    Espresso   Saturday
11       Latte   Saturday
12    Espresso     Sunday
13       Latte     Sunday

##### Let’s say you know what columns you don’t want in the dataframe. Pass those as a list to the difference method and you’ll get back everything except them.

In [45]:
cofee_data[cofee_data.columns.difference(['Coffee Type', 'Day'])]

    Units Sold
0           25
1           15
2           30
3           20
4           35
5           25
6           40
7           30
8           45
9           35
10          45
11          35
12          45
13          35

1) .head(), This method give first 5 rows of the data, if no argument is passed, but when we provide an argument then it will return data accordingly.

In [5]:
print(cofee_data.head()) # Return 5 rows, if no argument is passed.
# print(cofee_data.head(9))

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

1) .tail(), This method give data from bottom 5 rows, if no argument is passed, but when we provide an argument then it will return data accordingly.

In [8]:
print(cofee_data.tail()) # Return 5 rows from bottom, if no argument is passed.
# print(cofee_data.tail(9))

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

3) Getting random data from dataset. By default it returns 1 row only, but if we pass argument to it then .sample() return no. of rows accordingly.

In [18]:
cofee_data.sample(4)

          Day Coffee Type  Units Sold
12     Sunday    Espresso          45
2     Tuesday    Espresso          30
0      Monday    Espresso          25
4   Wednesday    Espresso          35

4.A. Using "loc" attribute.
- In .loc[], we need to define our columns by names.
- SYNTAX FOR:
  - .loc[rows, ['colName-1', 'colName-2']]
- rows & columns both can also be mention through slicing.

In [8]:
# print(cofee_data.loc[4:8, ['Coffee Type', 'Units Sold']])   # give rows from 4-8 of columns 'Coffee Type', 'Units Sold'.
#print(cofee_data.loc[[7,10], ['Coffee Type', 'Day']]) # give rows at index 7 and 10 of columns 'Coffee Type', 'Day'
print(cofee_data.loc[4:8, 'Day':'Units Sold'])  # Row & Columns both can be call through slicing.

         Day Coffee Type  Units Sold
4  Wednesday    Espresso          35
5  Wednesday       Latte          25
6   Thursday    Espresso          40
7   Thursday       Latte          30
8     Friday    Espresso          45

In [7]:
# A slight difference b/w two below lines but results are same.. 
print(cofee_data.loc[0:1]) 
# print(cofee_data.loc[[0,1]])

      Day Coffee Type  Units Sold
0  Monday    Espresso          25
1  Monday       Latte          15

4.B. Using "iloc" attribute.
- In .iloc[], we need to define our columns by indexes.
- SYNTAX FOR:
  - .iloc[rows-index, col-index]
- rows and columns can also be mention through slicing.

In [11]:
# print(cofee_data.iloc[0:3, :]) # Return row from 0-3, and all columns.
print(cofee_data.iloc[:, [0,2]]) # Return all rows and col-0 and col-2 columns.

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

5). Update Data using .loc and .iloc

In [24]:
cofee_data.loc[11: , 'Units Sold'] = 120000000
cofee_data.iloc[3:8 , [0,2]] = 254902156783

In [25]:
cofee_data

             Day Coffee Type    Units Sold
0         Monday    Espresso            25
1         Monday       Latte            15
2        Tuesday    Espresso            30
3   254902156783       Latte  254902156783
4   254902156783    Espresso  254902156783
5   254902156783       Latte  254902156783
6   254902156783    Espresso  254902156783
7   254902156783       Latte  254902156783
8         Friday    Espresso            45
9         Friday       Latte            35
10      Saturday    Espresso            45
11      Saturday       Latte     120000000
12        Sunday    Espresso     120000000
13        Sunday       Latte     120000000

In [28]:
cofee_data

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

6.) Sorting Data In Ascending/Descending Order
- SYNTAX:
  - .sort_values([col-names, ......], ascending = True/False)

In [36]:
cofee_data.sort_values(['Coffee Type', 'Units Sold'], ascending = True)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
2     Tuesday    Espresso          30
4   Wednesday    Espresso          35
6    Thursday    Espresso          40
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
1      Monday       Latte          15
3     Tuesday       Latte          20
5   Wednesday       Latte          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35

In [39]:
cofee_data.columns

Index(['Day', 'Coffee Type', 'Units Sold'], dtype='object')

#### FILTERING DATA

In [9]:
bios_data = pd.read_csv("bios (1).csv")
bios_data.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

- Filtering Data on basis of name.

In [14]:
bios_data[bios_data['name'].str.contains('keith', case= False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Keith,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Keith,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Keith,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Keith,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Keith,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Keith,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Keith,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Keith,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,Keith,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Keith,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

#### Adding/Removing Columns